app/Controllers/Home.php

SELECT `id`, `label`, `link_url`, `n_type`, `target`, `pid`, `thumb`
FROM `c_nav`
WHERE `status` = 1
ORDER BY `sort_order` desc
 LIMIT 14
---
    public function index(): string
    {
        $SwiperModel = new SwiperModel();
//        取logo 轮播图
        $swiper_list =$SwiperModel->getSwiperList('title,href','is_show=1','is_show=1');
        $data['swiper_list']=$swiper_list;
//        取菜单栏
        $NavModel = new NavModel();
        $cat_list = $NavModel->select("id,label,link_url,n_type,target,pid,thumb")->where('status=1')->orderBy('sort_order desc')->limit(14)->get()->getResultArray();

SELECT `id`, `link_url`, `label`, `n_type`, `target`, `pid`
FROM `c_nav`
WHERE `id` = '14'
AND `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `c_article`
WHERE `nav_id` = '14'
SELECT `c_article`.`id`, `article_title`, `author`, `c_article`.`sort_order`, `atime`, `update_date`, `updater_id`, `c_article`.`is_show`
FROM `c_article`
WHERE `nav_id` = '14'
ORDER BY `c_article`.`sort_order` desc, `update_date` Desc
 LIMIT 10
SELECT `id`, `link_url`, `label`, `n_type`, `target`, `pid`
FROM `c_nav`
WHERE `status` = 1
ORDER BY `sort_order` desc, `id` asc
 LIMIT 14
---
    public function  category($cid=1){
        if ($cid){
            $ArticleModel = new ArticleModel();
            $NavModel = new NavModel();
            $SwiperModel = new SwiperModel();
//            获取栏目类别，如为链接跳转类型，则显示出错。
            $n_current = $NavModel->select("id,link_url,label,n_type,target,pid")->where('id',$cid)->where('status=1')->get()->getRow();
            if (empty($n_current)){
                throw new \CodeIgniter\Exceptions\PageNotFoundException('页面未找到');
            }else{
                if ($n_current->n_type==5){
                    throw new \CodeIgniter\Exceptions\PageNotFoundException('页面未找到');
                }
            }


            $swiper_list =$SwiperModel->getSwiperList('title,href','is_show=1','is_show=1');
            $data = [
                'list'  => $ArticleModel->select('article.id,article_title,author,article.sort_order,atime,update_date,updater_id,article.is_show')
                    ->where('nav_id',$cid)
                    ->orderBy('article.sort_order desc,update_date Desc')
                    ->paginate(10,'alist'),
                'pager' => $ArticleModel->pager,

            ];

                $cat_list = $NavModel->select("id,link_url,label,n_type,target,pid")->where('status=1')->orderBy('sort_order desc,id asc')->limit(14)->get()->getResultArray();

SELECT `id`, `label`, `n_type`, `link_url`, `target`, `pid`
FROM `c_nav`
WHERE `status` = 1
ORDER BY `sort_order` desc, `id` asc
 LIMIT 14
---
    public function  article($aid=1){
        $ArticleModel = new ArticleModel();
        $NavModel = new NavModel();
        $SwiperModel = new SwiperModel();
        $swiper_list =$SwiperModel->getSwiperList('title,href','is_show=1','is_show=1');
        $article='';
        if ($aid){
            $article=$ArticleModel->getArticle('article.id,article_title,author,atime,article_content.content,nav_id',$aid);

            if (!empty($article)){
                $cat_list = $NavModel->select("id,label,n_type,link_url,target,pid")->where('status=1')->orderBy('sort_order desc,id asc')->limit(14)->get()->getResultArray();